## **[MySQL IN operator](https://www.mysqltutorial.org/mysql-basics/mysql-in/)**

Use MySQL IN operator to determine if a specified value matches any value in a list of values.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL IN operator

In [3]:
pd.read_sql('select 1 in (1, 2, 3), 4 in (1,2,3)', engine)

   1 in (1, 2, 3)  4 in (1,2,3)
0               1             0

### MySQL IN operator and NULL

In [4]:
string = '''
SELECT 
    NULL IN (1,2,3),
    0 IN (1,2,3,NULL),
    NULL IN (1,2,3,NULL)
;'''

pd.read_sql(string, engine)

  NULL IN (1,2,3) 0 IN (1,2,3,NULL) NULL IN (1,2,3,NULL)
0            None              None                 None

### MySQL IN operator examples

In [5]:
string = '''
SELECT officeCode, city, phone, country
FROM offices
WHERE
    country IN ('USA', 'France')
    # country = 'USA' OR country = 'France'
;'''

pd.read_sql(string, engine)

  officeCode           city            phone country
0          1  San Francisco  +1 650 219 4782     USA
1          2         Boston  +1 215 837 0825     USA
2          3            NYC  +1 212 555 3000     USA
3          4          Paris  +33 14 723 4404  France

In [6]:
(pd.read_sql_table('offices', engine)
 .query("country in ['USA', 'France']")
 [['officeCode', 'city', 'phone', 'country']]
)

  officeCode           city            phone country
0          1  San Francisco  +1 650 219 4782     USA
1          2         Boston  +1 215 837 0825     USA
2          3            NYC  +1 212 555 3000     USA
3          4          Paris  +33 14 723 4404  France